# Sf Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Sf Property
SymbolTypeId Class See Also
---
Symbol SF, indicating unit Square feet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Sf { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Sf As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Sf {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace